# Question 0

"""
Create a function that takes a list of strings and integers, and filters out the list so that it returns a list of integers only.

Examples:
    filter_list([1, 2, 3, "a", "b", 4]) returns [1, 2, 3, 4]

    filter_list(['A', 0, 'Edabit', 1729, 'Python', '1729']) returns [0, 1729]

Notes:
    - Function always returns list
"""

In [4]:
def filter_list(lst):
    new_lst = []
    for item in lst:
        if type(item) == str:
            continue
        else:
            new_lst.append(item)
    return new_lst

In [6]:
filter_list(['A', 0, 'Edabit', 1729, 'Python', '1729'])

[0, 1729]

In [2]:
type('Edabit')

str

In [3]:
type(0)

int

In [7]:
new_lst = []

for item in lst:
    if type(item) == str:
        continue
    else:
        new_lst.append(item)
return new_lst

NameError: name 'lst' is not defined

# Question 1

"""
Create a function that returns the mean of all digits.

Example:
    mean(42) ➞ 3.0

    mean(12345) ➞ 3.0

    mean(666) ➞ 6.0

Notes:
    - Function should always return float
"""

In [24]:
def mean(digits):
    digit_list = []
    mean_list = []
    digit_list = list(str(digits))
    for item in digit_list:
        mean_list.append(int(item))
    return(sum(mean_list) / len(mean_list))

In [25]:
mean(12345)

3.0

In [26]:
mean(666)

6.0

In [27]:
mean(42)

3.0

In [12]:
digits = 12345
digit_list = list(str(digits))
digit_list

['1', '2', '3', '4', '5']

In [13]:
mean_list = []
for item in digit_list:
    mean_list.append(int(item))

In [17]:
sum(mean_list) / len(mean_list)

3.0

# Question 3

"""
Write a function that takes a string and calculates the number of letters and digits within it. Return the result in a dictionary.

Examples:
    count_all("Hello World") ➞ { "LETTERS":  10, "DIGITS": 0 }

    count_all("H3ll0 Wor1d") ➞ { "LETTERS":  7, "DIGITS": 3 }

    count_all("149990") ➞ { "LETTERS": 0, "DIGITS": 6 }

Notes:
    - Tests contain only alphanumeric characters.
    - Spaces are not letters.
    - All tests contain valid strings.
    - The function should return dictionary

"""

In [71]:
def count_all(string):
    string = string.replace(' ','')
    digit_list = []
    alpha_list = []

    for char in string:
        if char.isnumeric():
            digit_list.append(char)
        else:
            alpha_list.append(char)
    letter_dict = {" LETTERS ":len(alpha_list),
               " DIGITS ":len(digit_list)}
    return letter_dict

In [72]:
count_all("Hello World")

{' LETTERS ': 10, ' DIGITS ': 0}

In [73]:
count_all("H3ll0 Wor1d")

{' LETTERS ': 7, ' DIGITS ': 3}

In [68]:
result = count_all("149990")

In [69]:
result

{'LETTERS': 0, 'DIGITS': 6}

In [70]:
type(result)

dict

In [ ]:
letter_dict = {"LETTERS":,
               "DIGITS":}

In [38]:
test_string = "H3ll0 Wor1d"

In [39]:
len(test_string)

11

In [49]:
test_string = test_string.replace(' ','')

In [50]:
'H'.isnumeric()

False

In [57]:
digit_list = []
alpha_list = []

for char in test_string:
    if char.isnumeric():
        digit_list.append(char)
    else:
        alpha_list.append(char)
letter_dict = {"LETTERS":len(alpha_list),
               "DIGITS":len(digit_list)}
print(letter_dict)

{'LETTERS': 7, 'DIGITS': 3}

In [55]:
len(digit_list)

3

In [56]:
len(alpha_list)

7

# Question 3

"""
 - Connect to the hr.db (stored in supporting-files directory) with sqlite3 
 - Write a query to get the names (first_name, last_name), salary, PF of all the employees (PF is calculated as 12% of salary)

Expected columns:
    - first_name	
    - last_name	
    - salary
    - PF

Notes:
    - You can connect to DB from Jupyter Lab/Notebook, explore the table and try different queries
    - In the variable 'SQL' store only the final query ready for validation 
"""

In [74]:
import sqlite3
from sqlite3 import Error

In [76]:
connection = sqlite3.connect("../../../../assessment-exam-student-python/supporting_files/hr.db")

In [77]:
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query executed successfully")
    except Error as e:
        print(f"The error '{e}' occurred")

In [78]:
import pandas as pd

In [79]:
pd.read_sql("SELECT * FROM employees", connection)

,employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id
0,100,Steven,King,steven.king@sqltutorial.org,515.123.4567,1987-06-17,4,24000.0,NaN,9
1,101,Neena,Kochhar,neena.kochhar@sqltutorial.org,515.123.4568,1989-09-21,5,17000.0,100.0,9
2,102,Lex,De Haan,lex.de haan@sqltutorial.org,515.123.4569,1993-01-13,5,17000.0,100.0,9
3,103,Alexander,Hunold,alexander.hunold@sqltutorial.org,590.423.4567,1990-01-03,9,9000.0,102.0,6
4,104,Bruce,Ernst,bruce.ernst@sqltutorial.org,590.423.4568,1991-05-21,9,6000.0,103.0,6
5,105,David,Austin,david.austin@sqltutorial.org,590.423.4569,1997-06-25,9,4800.0,103.0,6
6,106,Valli,Pataballa,valli.pataballa@sqltutorial.org,590.423.4560,1998-02-05,9,4800.0,103.0,6
7,107,Diana,Lorentz,diana.lorentz@sqltutorial.org,590.423.5567,1999-02-07,9,4200.0,103.0,6
8,108,Nancy,Greenberg,nancy.greenberg@sqltutorial.org,515.124.4569,1994-08-17,7,12000.0,101.0,10
9,109,Daniel,Faviet,daniel.faviet@sqltutorial.org,515.124.4169,1994-08-16,6,9000.0,108.0,10
10,110,John,Chen,john.chen@sqltutorial.org,515.124.4269,1997-09-28,6,8200.0,108.0,10
11,111,Ismael,Sciarra,ismael.sciarra@sqltutorial.org,515.124.4369,1997-09-30,6,7700.0,108.0,10
12,112,Jose Manuel,Urman,jose manuel.urman@sqltutorial.org,515.124.4469,1998-03-07,6,7800.0,108.0,10
13,113,Luis,Popp,luis.popp@sqltutorial.org,515.124.4567,1999-12-07,6,6900.0,108.0,10
14,114,Den,Raphaely,den.raphaely@sqltutorial.org,515.127.4561,1994-12-07,14,11000.0,100.0,3
15,115,Alexander,Khoo,alexander.khoo@sqltutorial.org,515.127.4562,1995-05-18,13,3100.0,114.0,3
16,116,Shelli,Baida,shelli.baida@sqltutorial.org,515.127.4563,1997-12-24,13,2900.0,114.0,3
17,117,Sigal,Tobias,sigal.tobias@sqltutorial.org,515.127.4564,1997-07-24,13,2800.0,114.0,3
18,118,Guy,Himuro,guy.himuro@sqltutorial.org,515.127.4565,1998-11-15,13,2600.0,114.0,3
19,119,Karen,Colmenares,karen.colmenares@sqltutorial.org,515.127.4566,1999-08-10,13,2500.0,114.0,3
20,120,Matthew,Weiss,matthew.weiss@sqltutorial.org,650.123.1234,1996-07-18,19,8000.0,100.0,5
21,121,Adam,Fripp,adam.fripp@sqltutorial.org,650.123.2234,1997-04-10,19,8200.0,100.0,5
22,122,Payam,Kaufling,payam.kaufling@sqltutorial.org,650.123.3234,1995-05-01,19,7900.0,100.0,5
23,123,Shanta,Vollman,shanta.vollman@sqltutorial.org,650.123.4234,1997-10-10,19,6500.0,100.0,5
24,126,Irene,Mikkilineni,irene.mikkilineni@sqltutorial.org,650.124.1224,1998-09-28,18,2700.0,120.0,5
25,145,John,Russell,john.russell@sqltutorial.org,None,1996-10-01,15,14000.0,100.0,8
26,146,Karen,Partners,karen.partners@sqltutorial.org,None,1997-01-05,15,13500.0,100.0,8
27,176,Jonathon,Taylor,jonathon.taylor@sqltutorial.org,None,1998-03-24,16,8600.0,100.0,8
28,177,Jack,Livingston,jack.livingston@sqltutorial.org,None,1998-04-23,16,8400.0,100.0,8
29,178,Kimberely,Grant,kimberely.grant@sqltutorial.org,None,1999-05-24,16,7000.0,100.0,8
30,179,Charles,Johnson,charles.johnson@sqltutorial.org,None,2000-01-04,16,6200.0,100.0,8
31,192,Sarah,Bell,sarah.bell@sqltutorial.org,650.501.1876,1996-02-04,17,4000.0,123.0,5
32,193,Britney,Everett,britney.everett@sqltutorial.org,650.501.2876,1997-03-03,17,3900.0,123.0,5
33,200,Jennifer,Whalen,jennifer.whalen@sqltutorial.org,515.123.4444,1987-09-17,3,4400.0,101.0,1
34,201,Michael,Hartstein,michael.hartstein@sqltutorial.org,515.123.5555,1996-02-17,10,13000.0,100.0,2
35,202,Pat,Fay,pat.fay@sqltutorial.org,603.123.6666,1997-08-17,11,6000.0,201.0,2
36,203,Susan,Mavris,susan.mavris@sqltutorial.org,515.123.7777,1994-06-07,8,6500.0,101.0,4
37,204,Hermann,Baer,hermann.baer@sqltutorial.org,515.123.8888,1994-06-07,12,10000.0,101.0,7
38,205,Shelley,Higgins,shelley.higgins@sqltutorial.org,515.123.8080,1994-06-07,2,12000.0,101.0,11
39,206,William,Gietz,william.gietz@sqltutorial.org,515.123.8181,1994-06-07,1,8300.0,205.0,11